Revit 2015 API
ExternalDefinitions Methods
The ExternalDefinitions type exposes the following members.
Methods
Name | Description
Contains
Tests for the existence of a definition within the set.
 (Inherited from Definitions.)
Create(ExternalDefinitonCreationOptions)
Creates a new parameter definition using specified options.
 (Inherited from Definitions.)
Create(String, ParameterType) |  Obsolete.
Creates a new parameter definition using name and type.
 (Inherited from Definitions.)
Create(String, ParameterType, Boolean) |  Obsolete.
Creates a new parameter definition using name, type and visibility.
 (Inherited from Definitions.)
Create(String, ParameterType, Boolean, Guid) |  Obsolete.
Creates a new parameter definition using name, type, visibility and a specified Guid.
 (Inherited from Definitions.)
Dispose |  (Inherited from Definitions.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetBasicIEnumerator
Returns an enumerator that iterates through a collection.
 (Inherited from Definitions.)
GetEnumerator
Retrieves an enumerator to the collection.
 (Inherited from Definitions.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
ExternalDefinitions Class
Autodesk.Revit.DB Namespace